tutorials/incompressible/MRFSimpleFoam/axialTurbine_mixingPlane/0_orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    GVINLET
    {
        type            zeroGradient;
    }
    GVOUTLET
    {
        type            mixingPlane;
    }
    GVCYCLIC
    {
        type            cyclic;
    }
    GVBLADE
    {
        type            zeroGradient;
    }
    GVHUB
    {
        type            zeroGradient;
    }
    GVSHROUD
    {
        type            zeroGradient;
    }
    RUINLET
    {
        type            mixingPlane;
    }
    RUOUTLET
    {
        type            mixingPlane;
    }
    RUCYCLIC1
    {
        type            cyclicGgi;
    }
    RUCYCLIC2
    {
        type            cyclicGgi;
    }
    RUBLADE
    {
        type            zeroGradient;
    }
    RUHUB
    {
        type            zeroGradient;
    }
    RUSHROUD
    {
        type            zeroGradient;
    }
    DTINLET
    {
        type            mixingPlane;
    }
    DTOUTLET
    {
        type            fixedValue;
        value           uniform 0;
    }
    DTCYCLIC1
    {
        type            cyclicGgi;
    }
    DTCYCLIC2
    {
        type            cyclicGgi;
    }
    DTHUB
    {
        type            zeroGradient;
    }
    DTSHROUD
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
